[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:14:82
  * @bodyparam user User
  * @returns user User
  */
-router.post('/users', async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const user = await createUser({ ...req.body.user, demo: false });
-    res.status(201).json({ user });
-  } catch (error) {
-    next(error);
-  }
-});
+router.post('/users', async (req: Request, res: Response, next: NextFunction) => {});
 
 /**

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:15:7
  * @returns user User
  */
 router.post('/users', async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const user = await createUser({ ...req.body.user, demo: false });
-    res.status(201).json({ user });
-  } catch (error) {
+  try {} catch (error) {
     next(error);
   }

[NoCoverage] BooleanLiteral
app/routes/auth/auth.controller.ts:16:61
  */
 router.post('/users', async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const user = await createUser({ ...req.body.user, demo: false });
+    const user = await createUser({ ...req.body.user, demo: true });
     res.status(201).json({ user });
   } catch (error) {

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:18:19
   try {
     const user = await createUser({ ...req.body.user, demo: false });
     res.status(201).json({ user });
-  } catch (error) {
-    next(error);
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:30:88
  * @bodyparam user User
  * @returns user User
  */
-router.post('/users/login', async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const user = await login(req.body.user);
-    res.json({ user });
-  } catch (error) {
-    next(error);
-  }
-});
+router.post('/users/login', async (req: Request, res: Response, next: NextFunction) => {});
 
 /**

[NoCoverage] StringLiteral
app/routes/auth/auth.controller.ts:30:13
  * @bodyparam user User
  * @returns user User
  */
-router.post('/users/login', async (req: Request, res: Response, next: NextFunction) => {
+router.post("", async (req: Request, res: Response, next: NextFunction) => {
   try {
     const user = await login(req.body.user);

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:31:7
  * @returns user User
  */
 router.post('/users/login', async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const user = await login(req.body.user);
-    res.json({ user });
-  } catch (error) {
+  try {} catch (error) {
     next(error);
   }

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:34:19
   try {
     const user = await login(req.body.user);
     res.json({ user });
-  } catch (error) {
-    next(error);
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:45:95
  * @route {GET} /user
  * @returns user User
  */
-router.get('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const user = await getCurrentUser(req.auth?.user?.id);
-    res.json({ user });
-  } catch (error) {
-    next(error);
-  }
-});
+router.get('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {});
 
 /**

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:46:7
  * @returns user User
  */
 router.get('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const user = await getCurrentUser(req.auth?.user?.id);
-    res.json({ user });
-  } catch (error) {
+  try {} catch (error) {
     next(error);
   }

[NoCoverage] OptionalChaining
app/routes/auth/auth.controller.ts:47:39
  */
 router.get('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const user = await getCurrentUser(req.auth?.user?.id);
+    const user = await getCurrentUser(req.auth?.user.id);
     res.json({ user });
   } catch (error) {

[NoCoverage] OptionalChaining
app/routes/auth/auth.controller.ts:47:39
  */
 router.get('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const user = await getCurrentUser(req.auth?.user?.id);
+    const user = await getCurrentUser(req.auth.user?.id);
     res.json({ user });
   } catch (error) {

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:61:95
  * @bodyparam user User
  * @returns user User
  */
-router.put('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const user = await updateUser(req.body.user, req.auth?.user?.id);
-    res.json({ user });
-  } catch (error) {
-    next(error);
-  }
-});
+router.put('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {});
 
 export default router;

[NoCoverage] BlockStatement
app/routes/auth/auth.controller.ts:62:7
  * @returns user User
  */
 router.put('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const user = await updateUser(req.body.user, req.auth?.user?.id);
-    res.json({ user });
-  } catch (error) {
+  try {} catch (error) {
     next(error);
   }

[NoCoverage] OptionalChaining
app/routes/auth/auth.controller.ts:63:50
  */
 router.put('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const user = await updateUser(req.body.user, req.auth?.user?.id);
+    const user = await updateUser(req.body.user, req.auth.user?.id);
     res.json({ user });
   } catch (error) {

[NoCoverage] OptionalChaining
app/routes/auth/auth.controller.ts:63:50
  */
 router.put('/user', auth.required, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const user = await updateUser(req.body.user, req.auth?.user?.id);
+    const user = await updateUser(req.body.user, req.auth?.user.id);
     res.json({ user });
   } catch (error) {
