[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:30:99
  * @queryparam favorited
  * @returns articles: list of articles
  */
-router.get('/articles', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const result = await getArticles(req.query, req.auth?.user?.id);
-    res.json(result);
-  } catch (error) {
-    next(error);
-  }
-});
+router.get('/articles', auth.optional, async (req: Request, res: Response, next: NextFunction) => {});
 
 /**

[NoCoverage] StringLiteral
app/routes/article/article.controller.ts:30:12
  * @queryparam favorited
  * @returns articles: list of articles
  */
-router.get('/articles', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
+router.get("", auth.optional, async (req: Request, res: Response, next: NextFunction) => {
   try {
     const result = await getArticles(req.query, req.auth?.user?.id);

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:31:7
  * @returns articles: list of articles
  */
 router.get('/articles', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const result = await getArticles(req.query, req.auth?.user?.id);
-    res.json(result);
-  } catch (error) {
+  try {} catch (error) {
     next(error);
   }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:32:49
  */
 router.get('/articles', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const result = await getArticles(req.query, req.auth?.user?.id);
+    const result = await getArticles(req.query, req.auth?.user.id);
     res.json(result);
   } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:32:49
  */
 router.get('/articles', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const result = await getArticles(req.query, req.auth?.user?.id);
+    const result = await getArticles(req.query, req.auth.user?.id);
     res.json(result);
   } catch (error) {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:34:19
   try {
     const result = await getArticles(req.query, req.auth?.user?.id);
     res.json(result);
-  } catch (error) {
-    next(error);
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:48:62
 router.get(
   '/articles/feed',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const result = await getFeed(
-        Number(req.query.offset),
-        Number(req.query.limit),
-        req.auth?.user?.id,
-      );
-      res.json(result);
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:49:9
   '/articles/feed',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const result = await getFeed(
-        Number(req.query.offset),
-        Number(req.query.limit),
-        req.auth?.user?.id,
-      );
-      res.json(result);
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:53:9
       const result = await getFeed(
         Number(req.query.offset),
         Number(req.query.limit),
-        req.auth?.user?.id,
+        req.auth.user?.id,
       );
       res.json(result);

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:53:9
       const result = await getFeed(
         Number(req.query.offset),
         Number(req.query.limit),
-        req.auth?.user?.id,
+        req.auth?.user.id,
       );
       res.json(result);

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:71:100
  * @bodyparam  tagList list of tags
  * @returns article created article
  */
-router.post('/articles', auth.required, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const article = await createArticle(req.body.article, req.auth?.user?.id);
-    res.status(201).json({ article });
-  } catch (error) {
-    next(error);
-  }
-});
+router.post('/articles', auth.required, async (req: Request, res: Response, next: NextFunction) => {});
 
 /**

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:72:7
  * @returns article created article
  */
 router.post('/articles', auth.required, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const article = await createArticle(req.body.article, req.auth?.user?.id);
-    res.status(201).json({ article });
-  } catch (error) {
+  try {} catch (error) {
     next(error);
   }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:73:59
  */
 router.post('/articles', auth.required, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const article = await createArticle(req.body.article, req.auth?.user?.id);
+    const article = await createArticle(req.body.article, req.auth?.user.id);
     res.status(201).json({ article });
   } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:73:59
  */
 router.post('/articles', auth.required, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const article = await createArticle(req.body.article, req.auth?.user?.id);
+    const article = await createArticle(req.body.article, req.auth.user?.id);
     res.status(201).json({ article });
   } catch (error) {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:75:19
   try {
     const article = await createArticle(req.body.article, req.auth?.user?.id);
     res.status(201).json({ article });
-  } catch (error) {
-    next(error);
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:90:62
 router.get(
   '/articles/:slug',
   auth.optional,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const article = await getArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ article });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:91:9
   '/articles/:slug',
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const article = await getArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ article });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:92:57
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const article = await getArticle(req.params.slug, req.auth?.user?.id);
+      const article = await getArticle(req.params.slug, req.auth.user?.id);
       res.json({ article });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:92:57
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const article = await getArticle(req.params.slug, req.auth?.user?.id);
+      const article = await getArticle(req.params.slug, req.auth?.user.id);
       res.json({ article });
     } catch (error) {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:94:21
     try {
       const article = await getArticle(req.params.slug, req.auth?.user?.id);
       res.json({ article });
-    } catch (error) {
-      next(error);
-    }
+    } catch (error) {}
   },
 );

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:113:62
 router.put(
   '/articles/:slug',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const article = await updateArticle(req.body.article, req.params.slug, req.auth?.user?.id);
-      res.json({ article });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:114:9
   '/articles/:slug',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const article = await updateArticle(req.body.article, req.params.slug, req.auth?.user?.id);
-      res.json({ article });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:115:78
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const article = await updateArticle(req.body.article, req.params.slug, req.auth?.user?.id);
+      const article = await updateArticle(req.body.article, req.params.slug, req.auth.user?.id);
       res.json({ article });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:115:78
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const article = await updateArticle(req.body.article, req.params.slug, req.auth?.user?.id);
+      const article = await updateArticle(req.body.article, req.params.slug, req.auth?.user.id);
       res.json({ article });
     } catch (error) {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:132:62
 router.delete(
   '/articles/:slug',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      await deleteArticle(req.params.slug, req.auth?.user!.id);
-      res.sendStatus(204);
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:133:9
   '/articles/:slug',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      await deleteArticle(req.params.slug, req.auth?.user!.id);
-      res.sendStatus(204);
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:134:44
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      await deleteArticle(req.params.slug, req.auth?.user!.id);
+      await deleteArticle(req.params.slug, req.auth.user!.id);
       res.sendStatus(204);
     } catch (error) {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:136:21
     try {
       await deleteArticle(req.params.slug, req.auth?.user!.id);
       res.sendStatus(204);
-    } catch (error) {
-      next(error);
-    }
+    } catch (error) {}
   },
 );

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:152:62
 router.get(
   '/articles/:slug/comments',
   auth.optional,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const comments = await getCommentsByArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ comments });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:153:9
   '/articles/:slug/comments',
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const comments = await getCommentsByArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ comments });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:154:68
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const comments = await getCommentsByArticle(req.params.slug, req.auth?.user?.id);
+      const comments = await getCommentsByArticle(req.params.slug, req.auth.user?.id);
       res.json({ comments });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:154:68
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const comments = await getCommentsByArticle(req.params.slug, req.auth?.user?.id);
+      const comments = await getCommentsByArticle(req.params.slug, req.auth?.user.id);
       res.json({ comments });
     } catch (error) {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:156:21
     try {
       const comments = await getCommentsByArticle(req.params.slug, req.auth?.user?.id);
       res.json({ comments });
-    } catch (error) {
-      next(error);
-    }
+    } catch (error) {}
   },
 );

[NoCoverage] StringLiteral
app/routes/article/article.controller.ts:171:3
  * @returns comment created comment
  */
 router.post(
-  '/articles/:slug/comments',
+  "",
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:173:62
 router.post(
   '/articles/:slug/comments',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const comment = await addComment(req.body.comment.body, req.params.slug, req.auth?.user?.id);
-      res.json({ comment });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:174:9
   '/articles/:slug/comments',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const comment = await addComment(req.body.comment.body, req.params.slug, req.auth?.user?.id);
-      res.json({ comment });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:175:80
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const comment = await addComment(req.body.comment.body, req.params.slug, req.auth?.user?.id);
+      const comment = await addComment(req.body.comment.body, req.params.slug, req.auth?.user.id);
       res.json({ comment });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:175:80
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const comment = await addComment(req.body.comment.body, req.params.slug, req.auth?.user?.id);
+      const comment = await addComment(req.body.comment.body, req.params.slug, req.auth.user?.id);
       res.json({ comment });
     } catch (error) {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:177:21
     try {
       const comment = await addComment(req.body.comment.body, req.params.slug, req.auth?.user?.id);
       res.json({ comment });
-    } catch (error) {
-      next(error);
-    }
+    } catch (error) {}
   },
 );

[NoCoverage] StringLiteral
app/routes/article/article.controller.ts:191:3
  * @param id id of the comment
  */
 router.delete(
-  '/articles/:slug/comments/:id',
+  "",
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:193:62
 router.delete(
   '/articles/:slug/comments/:id',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      await deleteComment(Number(req.params.id), req.auth?.user?.id);
-      res.status(200).json({});
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:194:9
   '/articles/:slug/comments/:id',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      await deleteComment(Number(req.params.id), req.auth?.user?.id);
-      res.status(200).json({});
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:195:50
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      await deleteComment(Number(req.params.id), req.auth?.user?.id);
+      await deleteComment(Number(req.params.id), req.auth?.user.id);
       res.status(200).json({});
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:195:50
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      await deleteComment(Number(req.params.id), req.auth?.user?.id);
+      await deleteComment(Number(req.params.id), req.auth.user?.id);
       res.status(200).json({});
     } catch (error) {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:197:21
     try {
       await deleteComment(Number(req.params.id), req.auth?.user?.id);
       res.status(200).json({});
-    } catch (error) {
-      next(error);
-    }
+    } catch (error) {}
   },
 );

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:213:62
 router.post(
   '/articles/:slug/favorite',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const article = await favoriteArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ article });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:214:9
   '/articles/:slug/favorite',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const article = await favoriteArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ article });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:215:62
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const article = await favoriteArticle(req.params.slug, req.auth?.user?.id);
+      const article = await favoriteArticle(req.params.slug, req.auth.user?.id);
       res.json({ article });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:215:62
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const article = await favoriteArticle(req.params.slug, req.auth?.user?.id);
+      const article = await favoriteArticle(req.params.slug, req.auth?.user.id);
       res.json({ article });
     } catch (error) {

[NoCoverage] ObjectLiteral
app/routes/article/article.controller.ts:216:16
   async (req: Request, res: Response, next: NextFunction) => {
     try {
       const article = await favoriteArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ article });
+      res.json({});
     } catch (error) {
       next(error);

[NoCoverage] StringLiteral
app/routes/article/article.controller.ts:231:3
  * @returns article unfavorited article
  */
 router.delete(
-  '/articles/:slug/favorite',
+  "",
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:233:62
 router.delete(
   '/articles/:slug/favorite',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const article = await unfavoriteArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ article });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/article/article.controller.ts:234:9
   '/articles/:slug/favorite',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const article = await unfavoriteArticle(req.params.slug, req.auth?.user?.id);
-      res.json({ article });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:235:64
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const article = await unfavoriteArticle(req.params.slug, req.auth?.user?.id);
+      const article = await unfavoriteArticle(req.params.slug, req.auth.user?.id);
       res.json({ article });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/article/article.controller.ts:235:64
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const article = await unfavoriteArticle(req.params.slug, req.auth?.user?.id);
+      const article = await unfavoriteArticle(req.params.slug, req.auth?.user.id);
       res.json({ article });
     } catch (error) {
