[NoCoverage] ObjectLiteral
app/routes/auth/auth.service.ts:19:63
     },
   });
 
-  const existingUserByUsername = await prisma.user.findUnique({
-    where: {
-      username,
-    },
-    select: {
-      id: true,
-    },
-  });
+  const existingUserByUsername = await prisma.user.findUnique({});
 
   if (existingUserByEmail || existingUserByUsername) {

[NoCoverage] ObjectLiteral
app/routes/auth/auth.service.ts:96:45
     throw new HttpException(422, { errors: { password: ["can't be blank"] } });
   }
 
-  const user = await prisma.user.findUnique({
-    where: {
-      email,
-    },
-    select: {
-      id: true,
-      email: true,
-      username: true,
-      password: true,
-      bio: true,
-      image: true,
-    },
-  });
+  const user = await prisma.user.findUnique({});
 
   if (user) {

[NoCoverage] ObjectLiteral
app/routes/auth/auth.service.ts:100:13
     where: {
       email,
     },
-    select: {
-      id: true,
-      email: true,
-      username: true,
-      password: true,
-      bio: true,
-      image: true,
-    },
+    select: {},
   });
 

[NoCoverage] BooleanLiteral
app/routes/auth/auth.service.ts:104:17
       id: true,
       email: true,
       username: true,
-      password: true,
+      password: false,
       bio: true,
       image: true,

[NoCoverage] BooleanLiteral
app/routes/auth/auth.service.ts:105:12
       email: true,
       username: true,
       password: true,
-      bio: true,
+      bio: false,
       image: true,
     },

[NoCoverage] ObjectLiteral
app/routes/auth/auth.service.ts:159:41
     hashedPassword = await bcrypt.hash(password, 10);
   }
 
-  const user = await prisma.user.update({
-    where: {
-      id: id,
-    },
-    data: {
-      ...(email ? { email } : {}),
-      ...(username ? { username } : {}),
-      ...(password ? { password: hashedPassword } : {}),
-      ...(image ? { image } : {}),
-      ...(bio ? { bio } : {}),
-    },
-    select: {
-      id: true,
-      email: true,
-      username: true,
-      bio: true,
-      image: true,
-    },
-  });
+  const user = await prisma.user.update({});
 
   return {
