[NoCoverage] ConditionalExpression
app/routes/article/article.service.ts:82:11
     orderBy: {
       createdAt: 'desc',
     },
-    skip: Number(query.offset) || 0,
+    skip: true,
     take: Number(query.limit) || 10,
     include: {

[NoCoverage] ConditionalExpression
app/routes/article/article.service.ts:83:11
       createdAt: 'desc',
     },
     skip: Number(query.offset) || 0,
-    take: Number(query.limit) || 10,
+    take: true,
     include: {
       tagList: {

[NoCoverage] ObjectLiteral
app/routes/article/article.service.ts:107:10
     },
   });
 
-  return {
-    articles: articles.map((article: any) => articleMapper(article, id)),
-    articlesCount,
-  };
+  return {};
 };
 

[NoCoverage] ConditionalExpression
app/routes/article/article.service.ts:131:11
     orderBy: {
       createdAt: 'desc',
     },
-    skip: offset || 0,
+    skip: true,
     take: limit || 10,
     include: {

[NoCoverage] ConditionalExpression
app/routes/article/article.service.ts:132:11
       createdAt: 'desc',
     },
     skip: offset || 0,
-    take: limit || 10,
+    take: false,
     include: {
       tagList: {

[NoCoverage] ObjectLiteral
app/routes/article/article.service.ts:180:57
 
   const slug = `${slugify(title)}-${id}`;
 
-  const existingTitle = await prisma.article.findUnique({
-    where: {
-      slug,
-    },
-    select: {
-      slug: true,
-    },
-  });
+  const existingTitle = await prisma.article.findUnique({});
 
   if (existingTitle) {

[NoCoverage] ObjectLiteral
app/routes/article/article.service.ts:277:31
 };
 
 const disconnectArticlesTags = async (slug: string) => {
-  await prisma.article.update({
-    where: {
-      slug,
-    },
-    data: {
-      tagList: {
-        set: [],
-      },
-    },
-  });
+  await prisma.article.update({});
 };
 

[NoCoverage] ObjectLiteral
app/routes/article/article.service.ts:298:17
     },
     select: {
       author: {
-        select: {
-          id: true,
-          username: true,
-        },
+        select: {},
       },
     },

[NoCoverage] ConditionalExpression
app/routes/article/article.service.ts:336:5
   }
 
   const tagList =
-    Array.isArray(article.tagList) && article.tagList?.length
+    true
       ? article.tagList.map((tag: string) => ({
           create: { name: tag },

[NoCoverage] LogicalOperator
app/routes/article/article.service.ts:336:5
   }
 
   const tagList =
-    Array.isArray(article.tagList) && article.tagList?.length
+    Array.isArray(article.tagList) || article.tagList?.length
       ? article.tagList.map((tag: string) => ({
           create: { name: tag },

[NoCoverage] ArrowFunction
app/routes/article/article.service.ts:337:29
 
   const tagList =
     Array.isArray(article.tagList) && article.tagList?.length
-      ? article.tagList.map((tag: string) => ({
-          create: { name: tag },
-          where: { name: tag },
-        }))
+      ? article.tagList.map(() => undefined)
       : [];
 

[NoCoverage] ObjectLiteral
app/routes/article/article.service.ts:390:13
     where: {
       slug,
     },
-    select: {
-      author: {
-        select: {
-          id: true,
-          username: true,
-        },
-      },
-    },
+    select: {},
   });
 

[NoCoverage] ObjectLiteral
app/routes/article/article.service.ts:478:51
     throw new HttpException(422, { errors: { body: ["can't be blank"] } });
   }
 
-  const article = await prisma.article.findUnique({
-    where: {
-      slug,
-    },
-    select: {
-      id: true,
-    },
-  });
+  const article = await prisma.article.findUnique({});
 
   const comment = await prisma.comment.create({

[NoCoverage] OptionalChaining
app/routes/article/article.service.ts:492:15
       body,
       article: {
         connect: {
-          id: article?.id,
+          id: article.id,
         },
       },

[NoCoverage] ObjectLiteral
app/routes/article/article.service.ts:501:14
         },
       },
     },
-    include: {
-      author: {
-        select: {
-          username: true,
-          bio: true,
-          image: true,
-          followedBy: true,
-        },
-      },
-    },
+    include: {},
   });
 

[NoCoverage] ObjectLiteral
app/routes/article/article.service.ts:513:10
     },
   });
 
-  return {
-    id: comment.id,
-    createdAt: comment.createdAt,
-    updatedAt: comment.updatedAt,
-    body: comment.body,
-    author: {
-      username: comment.author.username,
-      bio: comment.author.bio,
-      image: comment.author.image,
-      following: comment.author.followedBy.some((follow: any) => follow.id === id),
-    },
-  };
+  return {};
 };
 

[NoCoverage] MethodExpression
app/routes/article/article.service.ts:522:18
       username: comment.author.username,
       bio: comment.author.bio,
       image: comment.author.image,
-      following: comment.author.followedBy.some((follow: any) => follow.id === id),
+      following: comment.author.followedBy.every((follow: any) => follow.id === id),
     },
   };

[Survived] BlockStatement
app/routes/article/article.service.ts:545:17
     },
   });
 
-  if (!comment) {
-    throw new HttpException(404, {});
-  }
+  if (!comment) {}
 
   if (comment.author.id !== userId) {

[Survived] ConditionalExpression
app/routes/article/article.service.ts:545:7
     },
   });
 
-  if (!comment) {
+  if (false) {
     throw new HttpException(404, {});
   }

[Survived] OptionalChaining
app/routes/article/article.service.ts:600:14
   const result = {
     ...article,
     author: profileMapper(article.author, id),
-    tagList: article?.tagList.map((tag: Tag) => tag.name),
+    tagList: article.tagList.map((tag: Tag) => tag.name),
     favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
     favoritesCount: _count?.favoritedBy,

[Survived] ArrowFunction
app/routes/article/article.service.ts:600:35
   const result = {
     ...article,
     author: profileMapper(article.author, id),
-    tagList: article?.tagList.map((tag: Tag) => tag.name),
+    tagList: article?.tagList.map(() => undefined),
     favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
     favoritesCount: _count?.favoritedBy,

[Survived] MethodExpression
app/routes/article/article.service.ts:601:16
     ...article,
     author: profileMapper(article.author, id),
     tagList: article?.tagList.map((tag: Tag) => tag.name),
-    favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
+    favorited: article.favoritedBy.every((favorited: any) => favorited.id === id),
     favoritesCount: _count?.favoritedBy,
   };

[NoCoverage] EqualityOperator
app/routes/article/article.service.ts:601:61
     ...article,
     author: profileMapper(article.author, id),
     tagList: article?.tagList.map((tag: Tag) => tag.name),
-    favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
+    favorited: article.favoritedBy.some((favorited: any) => favorited.id !== id),
     favoritesCount: _count?.favoritedBy,
   };

[Killed] OptionalChaining
app/routes/article/article.service.ts:602:21
     author: profileMapper(article.author, id),
     tagList: article?.tagList.map((tag: Tag) => tag.name),
     favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
-    favoritesCount: _count?.favoritedBy,
+    favoritesCount: _count.favoritedBy,
   };
 
killedBy: ArticleService favoriteArticle should return the favorited article
statusReason: Error: expect(received).resolves.toHaveProperty()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot read properties of undefined (reading 'favoritedBy')]

[NoCoverage] ConditionalExpression
app/routes/article/article.service.ts:647:61
     ...article,
     author: profileMapper(article.author, id),
     tagList: article?.tagList.map((tag: Tag) => tag.name),
-    favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
+    favorited: article.favoritedBy.some((favorited: any) => true),
     favoritesCount: _count?.favoritedBy,
   };

[Survived] ArrowFunction
app/routes/article/article.service.ts:647:41
     ...article,
     author: profileMapper(article.author, id),
     tagList: article?.tagList.map((tag: Tag) => tag.name),
-    favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
+    favorited: article.favoritedBy.some(() => undefined),
     favoritesCount: _count?.favoritedBy,
   };
