[NoCoverage] BlockStatement
app/routes/auth/auth.ts:4:70
 import { expressjwt as jwt } from 'express-jwt';
 import * as express from 'express';
 
-const getTokenFromHeaders = (req: express.Request): string | null => {
-  if (
-    (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Token') ||
-    (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Bearer')
-  ) {
-    return req.headers.authorization.split(' ')[1];
-  }
-  return null;
-};
+const getTokenFromHeaders = (req: express.Request): string | null => {};
 
 const auth = {

[NoCoverage] LogicalOperator
app/routes/auth/auth.ts:6:5
 
 const getTokenFromHeaders = (req: express.Request): string | null => {
   if (
-    (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Token') ||
-    (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Bearer')
+    req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Token' && req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Bearer'
   ) {
     return req.headers.authorization.split(' ')[1];

[NoCoverage] ConditionalExpression
app/routes/auth/auth.ts:6:5
 
 const getTokenFromHeaders = (req: express.Request): string | null => {
   if (
-    (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Token') ||
-    (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Bearer')
+    false
   ) {
     return req.headers.authorization.split(' ')[1];

[NoCoverage] LogicalOperator
app/routes/auth/auth.ts:7:6
 const getTokenFromHeaders = (req: express.Request): string | null => {
   if (
     (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Token') ||
-    (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Bearer')
+    (req.headers.authorization || req.headers.authorization.split(' ')[0] === 'Bearer')
   ) {
     return req.headers.authorization.split(' ')[1];

[NoCoverage] ConditionalExpression
app/routes/auth/auth.ts:7:35
 const getTokenFromHeaders = (req: express.Request): string | null => {
   if (
     (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Token') ||
-    (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Bearer')
+    (req.headers.authorization && true)
   ) {
     return req.headers.authorization.split(' ')[1];

[NoCoverage] BlockStatement
app/routes/auth/auth.ts:8:5
   if (
     (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Token') ||
     (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Bearer')
-  ) {
-    return req.headers.authorization.split(' ')[1];
-  }
+  ) {}
   return null;
 };

[NoCoverage] StringLiteral
app/routes/auth/auth.ts:9:44
     (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Token') ||
     (req.headers.authorization && req.headers.authorization.split(' ')[0] === 'Bearer')
   ) {
-    return req.headers.authorization.split(' ')[1];
+    return req.headers.authorization.split("")[1];
   }
   return null;

[NoCoverage] ObjectLiteral
app/routes/auth/auth.ts:14:14
   return null;
 };
 
-const auth = {
-  required: jwt({
-    secret: process.env.JWT_SECRET || 'superSecret',
-    getToken: getTokenFromHeaders,
-    algorithms: ['HS256'],
-  }),
-  optional: jwt({
-    secret: process.env.JWT_SECRET || 'superSecret',
-    credentialsRequired: false,
-    getToken: getTokenFromHeaders,
-    algorithms: ['HS256'],
-  }),
-};
+const auth = {};
 
 export default auth;

[NoCoverage] ObjectLiteral
app/routes/auth/auth.ts:15:17
 };
 
 const auth = {
-  required: jwt({
-    secret: process.env.JWT_SECRET || 'superSecret',
-    getToken: getTokenFromHeaders,
-    algorithms: ['HS256'],
-  }),
+  required: jwt({}),
   optional: jwt({
     secret: process.env.JWT_SECRET || 'superSecret',

[NoCoverage] ConditionalExpression
app/routes/auth/auth.ts:16:13
 
 const auth = {
   required: jwt({
-    secret: process.env.JWT_SECRET || 'superSecret',
+    secret: true,
     getToken: getTokenFromHeaders,
     algorithms: ['HS256'],

[NoCoverage] LogicalOperator
app/routes/auth/auth.ts:16:13
 
 const auth = {
   required: jwt({
-    secret: process.env.JWT_SECRET || 'superSecret',
+    secret: process.env.JWT_SECRET && 'superSecret',
     getToken: getTokenFromHeaders,
     algorithms: ['HS256'],

[NoCoverage] ArrayDeclaration
app/routes/auth/auth.ts:18:17
   required: jwt({
     secret: process.env.JWT_SECRET || 'superSecret',
     getToken: getTokenFromHeaders,
-    algorithms: ['HS256'],
+    algorithms: [],
   }),
   optional: jwt({

[NoCoverage] ObjectLiteral
app/routes/auth/auth.ts:20:17
     getToken: getTokenFromHeaders,
     algorithms: ['HS256'],
   }),
-  optional: jwt({
-    secret: process.env.JWT_SECRET || 'superSecret',
-    credentialsRequired: false,
-    getToken: getTokenFromHeaders,
-    algorithms: ['HS256'],
-  }),
+  optional: jwt({}),
 };
 

[NoCoverage] ConditionalExpression
app/routes/auth/auth.ts:21:13
     algorithms: ['HS256'],
   }),
   optional: jwt({
-    secret: process.env.JWT_SECRET || 'superSecret',
+    secret: false,
     credentialsRequired: false,
     getToken: getTokenFromHeaders,

[NoCoverage] ConditionalExpression
app/routes/auth/auth.ts:21:13
     algorithms: ['HS256'],
   }),
   optional: jwt({
-    secret: process.env.JWT_SECRET || 'superSecret',
+    secret: true,
     credentialsRequired: false,
     getToken: getTokenFromHeaders,

[NoCoverage] BooleanLiteral
app/routes/auth/auth.ts:22:26
   }),
   optional: jwt({
     secret: process.env.JWT_SECRET || 'superSecret',
-    credentialsRequired: false,
+    credentialsRequired: true,
     getToken: getTokenFromHeaders,
     algorithms: ['HS256'],
