[NoCoverage] ArrowFunction
app/routes/auth/token.utils.ts:3:23
 import * as jwt from 'jsonwebtoken';
 
-const generateToken = (id: number): string =>
-  jwt.sign({ user: { id } }, process.env.JWT_SECRET || 'superSecret', {
-    expiresIn: '60d',
-  });
+const generateToken = () => undefined;
 
 export default generateToken;

[NoCoverage] ConditionalExpression
app/routes/auth/token.utils.ts:4:30
 import * as jwt from 'jsonwebtoken';
 
 const generateToken = (id: number): string =>
-  jwt.sign({ user: { id } }, process.env.JWT_SECRET || 'superSecret', {
+  jwt.sign({ user: { id } }, true, {
     expiresIn: '60d',
   });
