[Survived] ArrowFunction
app/routes/article/author.mapper.ts:3:22
 import { User } from '../auth/user.model';
 
-const authorMapper = (author: any, id?: number) => ({
-  username: author.username,
-  bio: author.bio,
-  image: author.image,
-  following: id
-    ? author?.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
-    : false,
-});
+const authorMapper = () => undefined;
 
 export default authorMapper;

[NoCoverage] OptionalChaining
app/routes/article/author.mapper.ts:8:7
   bio: author.bio,
   image: author.image,
   following: id
-    ? author?.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
+    ? author.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
     : false,
 });

[NoCoverage] MethodExpression
app/routes/article/author.mapper.ts:8:7
   bio: author.bio,
   image: author.image,
   following: id
-    ? author?.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
+    ? author?.followedBy.every((followingUser: Partial<User>) => followingUser.id === id)
     : false,
 });

[NoCoverage] BooleanLiteral
app/routes/article/author.mapper.ts:9:7
   image: author.image,
   following: id
     ? author?.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
-    : false,
+    : true,
 });
 
