[NoCoverage] BlockStatement
app/routes/profile/profile.controller.ts:17:62
 router.get(
   '/profiles/:username',
   auth.optional,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const profile = await getProfile(req.params.username, req.auth?.user?.id);
-      res.json({ profile });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/profile/profile.controller.ts:18:9
   '/profiles/:username',
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const profile = await getProfile(req.params.username, req.auth?.user?.id);
-      res.json({ profile });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/profile/profile.controller.ts:19:61
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const profile = await getProfile(req.params.username, req.auth?.user?.id);
+      const profile = await getProfile(req.params.username, req.auth?.user.id);
       res.json({ profile });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/profile/profile.controller.ts:19:61
   auth.optional,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const profile = await getProfile(req.params.username, req.auth?.user?.id);
+      const profile = await getProfile(req.params.username, req.auth.user?.id);
       res.json({ profile });
     } catch (error) {

[NoCoverage] BlockStatement
app/routes/profile/profile.controller.ts:21:21
     try {
       const profile = await getProfile(req.params.username, req.auth?.user?.id);
       res.json({ profile });
-    } catch (error) {
-      next(error);
-    }
+    } catch (error) {}
   },
 );

[NoCoverage] StringLiteral
app/routes/profile/profile.controller.ts:35:3
  * @returns profile
  */
 router.post(
-  '/profiles/:username/follow',
+  "",
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
app/routes/profile/profile.controller.ts:37:62
 router.post(
   '/profiles/:username/follow',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const profile = await followUser(req.params?.username, req.auth?.user?.id);
-      res.json({ profile });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/profile/profile.controller.ts:38:9
   '/profiles/:username/follow',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const profile = await followUser(req.params?.username, req.auth?.user?.id);
-      res.json({ profile });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/profile/profile.controller.ts:39:62
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const profile = await followUser(req.params?.username, req.auth?.user?.id);
+      const profile = await followUser(req.params?.username, req.auth?.user.id);
       res.json({ profile });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/profile/profile.controller.ts:39:62
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const profile = await followUser(req.params?.username, req.auth?.user?.id);
+      const profile = await followUser(req.params?.username, req.auth.user?.id);
       res.json({ profile });
     } catch (error) {

[NoCoverage] BlockStatement
app/routes/profile/profile.controller.ts:57:62
 router.delete(
   '/profiles/:username/follow',
   auth.required,
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const profile = await unfollowUser(req.params.username, req.auth?.user?.id);
-      res.json({ profile });
-    } catch (error) {
-      next(error);
-    }
-  },
+  async (req: Request, res: Response, next: NextFunction) => {},
 );
 

[NoCoverage] BlockStatement
app/routes/profile/profile.controller.ts:58:9
   '/profiles/:username/follow',
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const profile = await unfollowUser(req.params.username, req.auth?.user?.id);
-      res.json({ profile });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] OptionalChaining
app/routes/profile/profile.controller.ts:59:63
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const profile = await unfollowUser(req.params.username, req.auth?.user?.id);
+      const profile = await unfollowUser(req.params.username, req.auth?.user.id);
       res.json({ profile });
     } catch (error) {

[NoCoverage] OptionalChaining
app/routes/profile/profile.controller.ts:59:63
   auth.required,
   async (req: Request, res: Response, next: NextFunction) => {
     try {
-      const profile = await unfollowUser(req.params.username, req.auth?.user?.id);
+      const profile = await unfollowUser(req.params.username, req.auth.user?.id);
       res.json({ profile });
     } catch (error) {
