[Killed] ArrowFunction
app/routes/profile/profile.utils.ts:4:23
 import { User } from '../auth/user.model';
 import { Profile } from './profile.model';
 
-const profileMapper = (user: any, id: number | undefined): Profile => ({
-  username: user.username,
-  bio: user.bio,
-  image: user.image,
-  following: id
-    ? user?.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
-    : false,
-});
+const profileMapper = () => undefined;
 
 export default profileMapper;
killedBy: ProfileService getProfile should return a following property
statusReason: Error: expect(received).resolves.toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
app/routes/profile/profile.utils.ts:9:63
   bio: user.bio,
   image: user.image,
   following: id
-    ? user?.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
+    ? user?.followedBy.some((followingUser: Partial<User>) => false)
     : false,
 });
killedBy: ProfileUtils profileMapper should return a profile followed by the user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bio": "My happy life",
-   "following": true,

[Killed] ConditionalExpression
app/routes/profile/profile.utils.ts:9:63
   bio: user.bio,
   image: user.image,
   following: id
-    ? user?.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
+    ? user?.followedBy.some((followingUser: Partial<User>) => true)
     : false,
 });
killedBy: ProfileUtils profileMapper should return a profile not followed by the user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bio": "My happy life",
-   "following": false,

[NoCoverage] BooleanLiteral
app/routes/profile/profile.utils.ts:10:7
   image: user.image,
   following: id
     ? user?.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
-    : false,
+    : true,
 });
 
