[NoCoverage] BlockStatement
app/routes/tag/tag.controller.ts:13:95
  * @route {GET} /api/tags
  * @returns tags list of tag names
  */
-router.get('/tags', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const tags = await getTags(req.auth?.user?.id);
-    res.json({ tags });
-  } catch (error) {
-    next(error);
-  }
-});
+router.get('/tags', auth.optional, async (req: Request, res: Response, next: NextFunction) => {});
 
 export default router;

[NoCoverage] StringLiteral
app/routes/tag/tag.controller.ts:13:12
  * @route {GET} /api/tags
  * @returns tags list of tag names
  */
-router.get('/tags', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
+router.get("", auth.optional, async (req: Request, res: Response, next: NextFunction) => {
   try {
     const tags = await getTags(req.auth?.user?.id);

[NoCoverage] BlockStatement
app/routes/tag/tag.controller.ts:14:7
  * @returns tags list of tag names
  */
 router.get('/tags', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const tags = await getTags(req.auth?.user?.id);
-    res.json({ tags });
-  } catch (error) {
+  try {} catch (error) {
     next(error);
   }

[NoCoverage] OptionalChaining
app/routes/tag/tag.controller.ts:15:32
  */
 router.get('/tags', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const tags = await getTags(req.auth?.user?.id);
+    const tags = await getTags(req.auth?.user.id);
     res.json({ tags });
   } catch (error) {

[NoCoverage] OptionalChaining
app/routes/tag/tag.controller.ts:15:32
  */
 router.get('/tags', auth.optional, async (req: Request, res: Response, next: NextFunction) => {
   try {
-    const tags = await getTags(req.auth?.user?.id);
+    const tags = await getTags(req.auth.user?.id);
     res.json({ tags });
   } catch (error) {

[NoCoverage] BlockStatement
app/routes/tag/tag.controller.ts:17:19
   try {
     const tags = await getTags(req.auth?.user?.id);
     res.json({ tags });
-  } catch (error) {
-    next(error);
-  }
+  } catch (error) {}
 });
 
