[NoCoverage] ArrayDeclaration
app/routes/tag/tag.service.ts:5:19
 import { Tag } from './tag.model';
 
 const getTags = async (id?: number): Promise<string[]> => {
-  const queries = [];
+  const queries = ["Stryker was here"];
   queries.push({ demo: true });
 

[NoCoverage] StringLiteral
app/routes/tag/tag.service.ts:31:17
     },
     orderBy: {
       articles: {
-        _count: 'desc',
+        _count: "",
       },
     },
