[Survived] ObjectLiteral
app/routes/profile/profile.service.ts:6:48
 import HttpException from '../../models/http-exception.model';
 
 export const getProfile = async (usernamePayload: string, id?: number) => {
-  const profile = await prisma.user.findUnique({
-    where: {
-      username: usernamePayload,
-    },
-    include: {
-      followedBy: true,
-    },
-  });
+  const profile = await prisma.user.findUnique({});
 
   if (!profile) {

[Survived] ObjectLiteral
app/routes/profile/profile.service.ts:23:44
 };
 
 export const followUser = async (usernamePayload: string, id: number) => {
-  const profile = await prisma.user.update({
-    where: {
-      username: usernamePayload,
-    },
-    data: {
-      followedBy: {
-        connect: {
-          id,
-        },
-      },
-    },
-    include: {
-      followedBy: true,
-    },
-  });
+  const profile = await prisma.user.update({});
 
   return profileMapper(profile, id);
